gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Copier le nom du preset
  strncpy(presets[presetIndex].name, presetName, 15);
  presets[presetIndex].name[15] = '\0';
  
  // Copier les valeurs des paramètres
  for (int i = 0; i < PRESET_SIZE; i++) {
    presets[presetIndex].values[i] = parameters[i].value;
  }
  
  //Serial.println("Preset " + String(presetIndex) + " sauvegardé en RAM: " + String(presetName));
}

// Fonction pour charger un preset
void loadPreset(uint8_t presetIndex) {
  if (presetIndex >= MAX_PRESETS) {
    Serial.println("Index de preset invalide");
    return;
  }
  
  // Appliquer les valeurs aux paramètres
  for (int i = 0; i < PRESET_SIZE; i++) {
    parameters[i].value = presets[presetIndex].values[i];
    dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;
  }
  
  // Les liens des contrôles physiques sont maintenant lus dynamiquement à chaque appel
  
  Serial.println("Preset " + String(presetIndex) + " chargé: " + String(presets[presetIndex].name));
}

// Fonction pour afficher tous les paramètres
void printParameters() {
  //Serial.println("=== Paramètres actuels ===");
  for (int i = 0; i < PRESET_SIZE; i++) {
    //Serial.println(String(parameters[i].name) + " (DMX " + String(parameters[i].dmxChannel) + "): " + String(parameters[i].value));
  }
  //Serial.println("==========================");
}

// Fonction pour initialiser les paramètres par défaut
void initializeParameters() {
  for (int i = 0; i < PRESET_SIZE; i++) {
    parameters[i].value = parameters[i].defaultValue;
    dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;
  }
  //Serial.println("Paramètres initialisés aux valeurs par défaut");
}



// Fonction pour enregistrer tous les paramètres d'un coup (40 arguments)
void setAllParameters(uint8_t autopan_depth, uint8_t pitch, uint8_t vibrato_speed, uint8_t vibrato_depth,
                     uint8_t delay_time, uint8_t delay_feedback, uint8_t osc_waveform, uint8_t gate_threshold,
                     uint8_t portamento_time, uint8_t scale, uint8_t octave_low_high, uint8_t osc2_volume,
                     uint8_t osc2_pitch_offset, uint8_t autopan_frequency, uint8_t scale_tonic,
                     uint8_t volume_drums, uint8_t trig_kick, uint8_t trig_snare, uint8_t trig_hh,
                     uint8_t master_volume, uint8_t filter_on_off, uint8_t filter_cutoff,
                     uint8_t filter_reso, uint8_t filter_type,
                     // Nouveaux paramètres
                     uint8_t ir1_target_param, uint8_t ir2_target_param, uint8_t fader1_target_param, uint8_t fader2_target_param, uint8_t fader3_target_param,
                     uint8_t button3_target_param, uint8_t button3_released_value, uint8_t button3_pressed_value,
                     uint8_t rgb1_red, uint8_t rgb1_green, uint8_t rgb1_blue,
                     uint8_t rgb2_red, uint8_t rgb2_green, uint8_t rgb2_blue,
                     uint8_t dimmer1_source, uint8_t dimmer2_source) {
  
  // Mettre à jour tous les paramètres existants (0-23)
  parameters[0].value = autopan_depth;
  parameters[1].value = pitch;
  parameters[2].value = vibrato_speed;
  parameters[3].value = vibrato_depth;
  parameters[4].value = delay_time;
  parameters[5].value = delay_feedback;
  parameters[6].value = osc_waveform;
  parameters[7].value = gate_threshold;
  parameters[8].value = portamento_time;
  parameters[9].value = scale;
  parameters[10].value = octave_low_high;
  parameters[11].value = osc2_volume;
  parameters[12].value = osc2_pitch_offset;
  parameters[13].value = autopan_frequency;
  parameters[14].value = scale_tonic;
  parameters[15].value = volume_drums;
  parameters[16].value = trig_kick;
  parameters[17].value = trig_snare;
  parameters[18].value = trig_hh;
  parameters[19].value = master_volume;
  parameters[20].value = filter_on_off;
  parameters[21].value = filter_cutoff;
  parameters[22].value = filter_reso;
  parameters[23].value = filter_type;
  
  // Mettre à jour les nouveaux paramètres (24-39)
  parameters[24].value = ir1_target_param;
  parameters[25].value = ir2_target_param;
  parameters[26].value = fader1_target_param;
  parameters[27].value = fader2_target_param;
  parameters[28].value = fader3_target_param;
  parameters[29].value = button3_target_param;
  parameters[30].value = button3_released_value;
  parameters[31].value = button3_pressed_value;
  parameters[32].value = rgb1_red;
  parameters[33].value = rgb1_green;
  parameters[34].value = rgb1_blue;
  parameters[35].value = rgb2_red;
  parameters[36].value = rgb2_green;
  parameters[37].value = rgb2_blue;
  parameters[38].value = dimmer1_source;
  parameters[39].value = dimmer2_source;
  
  // Mettre à jour le tableau DMX
  for (int i = 0; i < PRESET_SIZE; i++) {
    dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;
  }
  
  //Serial.println("Tous les paramètres mis à jour");
  printParameters();
}

// Fonction pour afficher tous les presets disponibles
void printAllPresets() {
  //Serial.println("=== Presets disponibles ===");
  for (int i = 0; i < MAX_PRESETS; i++) {
    //Serial.print("Preset " + String(i) + ": " + String(presets[i].name));
    //Serial.println(" (valeurs: " + String(presets[i].values[0]) + "," + String(presets[i].values[1]) + ",...)");
  }
  //Serial.println("===========================");
}



// Fonction pour lire et stabiliser un capteur IR
int readStabilizedIRSensor(int sensorPin, int* buffer, int& index, int& sum, bool& initialized) {
  // Lecture brute
  int rawValue = analogRead(sensorPin);
  
  // Application du filtre de stabilisation
  int stabilizedValue = stabilizeIRSensor(rawValue, buffer, index, sum, initialized);
  
  return stabilizedValue;
}

// Fonction pour mapping amélioré d'IR1 (pitch)
uint8_t mapIR1Logarithmic(int rawValue) {
  // Normaliser la valeur d'entrée (0-4095 → 0.0-1.0)
  float normalized = (float)rawValue / 4095.0;
  
  // Mapping exponentiel inverse pour plus de contrôle dans les petites distances
  // x^0.3 donne une courbe qui monte rapidement au début puis se stabilise
  float expMapped = pow(normalized, 0.3);
  
