gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
    // Obtenir la valeur actuelle du paramètre sélectionné
    uint8_t currentValue = parameters[selectedParameter].value;
    
    // Ajuster la valeur en fonction de la rotation
    int newValue = currentValue + (delta * 2); // Multiplier par 2 pour un contrôle plus sensible
    
    // Limiter la valeur entre 0 et 255
    if (newValue < 0) newValue = 0;
    if (newValue > 255) newValue = 255;
    
    // Mettre à jour le paramètre
    parameters[selectedParameter].value = (uint8_t)newValue;
    dmxValues[parameters[selectedParameter].dmxChannel - 1] = (uint8_t)newValue;
    
    // Afficher les informations détaillées de debug
    Serial.print("🔄 ROTATION: ");
    if (delta > 0) {
      Serial.print("+");
    }
    Serial.print(delta);
    Serial.print(" | Encoder: ");
    Serial.print(currentEncoderValue);
    Serial.print(" | ");
    Serial.print(parameters[selectedParameter].name);
    Serial.print(" (DMX ");
    Serial.print(parameters[selectedParameter].dmxChannel);
    Serial.print("): ");
    Serial.print(currentValue);
    Serial.print(" → ");
    Serial.print((uint8_t)newValue);
    Serial.print(" [");
    Serial.print((uint8_t)newValue * 100 / 255);
    Serial.println("%]");
    
    lastEncoderValue = currentEncoderValue;
  }
  
  // Gestion du bouton pour changer de paramètre
  bool buttonState = !digitalRead(ENCODER_BUTTON_PIN); // Inversé car INPUT_PULLUP
  
  if (buttonState && !encoderButtonPressed && (millis() - lastButtonPress > BUTTON_DEBOUNCE)) {
    selectedParameter = (selectedParameter + 1) % PRESET_SIZE; // Passer au paramètre suivant
    
    Serial.println("🔘 BOUTON PRESSÉ - Changement de paramètre");
    Serial.print("  📋 Paramètre ");
    Serial.print(selectedParameter);
    Serial.print("/19: '");
    Serial.print(parameters[selectedParameter].name);
    Serial.print("'");
    Serial.println("");
    Serial.print("  📡 DMX Channel: ");
    Serial.print(parameters[selectedParameter].dmxChannel);
    Serial.print(" | Valeur actuelle: ");
    Serial.print(parameters[selectedParameter].value);
    Serial.print(" [");
    Serial.print(parameters[selectedParameter].value * 100 / 255);
    Serial.println("%]");
    Serial.println("  ──────────────────────────────────────");
    
    encoderButtonPressed = true;
    lastButtonPress = millis();
  }
  
  if (!buttonState) {
    encoderButtonPressed = false;
  }
  
  // Affichage périodique du statut du rotary encoder
  if (millis() - lastEncoderStatusTime >= ENCODER_STATUS_INTERVAL) {
    Serial.println("📊 STATUT ROTARY ENCODER:");
    Serial.print("  🎯 Paramètre actuel: ");
    Serial.print(selectedParameter);
    Serial.print("/19 - '");
    Serial.print(parameters[selectedParameter].name);
    Serial.println("'");
    Serial.print("  📡 DMX Channel: ");
    Serial.print(parameters[selectedParameter].dmxChannel);
    Serial.print(" | Valeur: ");
    Serial.print(parameters[selectedParameter].value);
    Serial.print(" [");
    Serial.print(parameters[selectedParameter].value * 100 / 255);
    Serial.println("%]");
    Serial.print("  🔢 Compteur encoder: ");
    Serial.println(encoder.getCount());
    Serial.println("  ──────────────────────────────────────");
    
    lastEncoderStatusTime = millis();
  }
}
*/

/*Paramètres Ksoloti
1 autopan depth
2 pitch
3 vibrato speed
4 vibrato depth
5 delay time
6 delay feedback
7 osc waveform
8 gate threshold
9 portamento time
10 scale
11 octave low high
12 OSC 2 volume
13 OSC 2 pitch offset
14 autopan frequency
15 scale tonic
16 volume drums
17 trig kick
18 trig snare
19 trig hh
20 master volume (inverted)
21 filter on-off 
22 filter cutoff
23 filter reso
24 filter type
*/
// Fonction d'initialisation des presets
void initializePresets() {

/*
Targets : (0=IR1, 1=IR2, 2=Fader1, 3=Fader2, 4=Fader3)

1  = autopan_depth           11 = octave_low_high          21 = filter_on_off            31 = button3_released_value
2  = pitch                   12 = osc2_volume              22 = filter_cutoff            32 = button3_pressed_value
3  = vibrato_speed           13 = osc2_pitch_offset        23 = filter_reso              33 = rgb1_red
4  = vibrato_depth           14 = autopan_frequency        24 = filter_type              34 = rgb1_green
5  = delay_time              15 = scale_tonic              25 = ir1_target_param         35 = rgb1_blue
6  = delay_feedback          16 = volume_drums             26 = ir2_target_param         36 = rgb2_red
7  = osc_waveform            17 = trig_kick                27 = fader1_target_param      37 = rgb2_green
8  = gate_threshold          18 = trig_snare               28 = fader2_target_param      38 = rgb2_blue
9  = portamento_time         19 = trig_hh                  29 = fader3_target_param      39 = dimmer1_source
10 = scale                   20 = master_volume            30 = button3_target_param     40 = dimmer2_source
*/
  Serial.println("Initialisation des presets...");

  
  // Preset 5 - Furious octaver growl feedbacker
  //                 1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40
  setAllParameters(  0,150,221, 10, 74,241,255,  0, 91,255,  0,255,196,  0,  0,255,  0,  0,  0, 50,  0,  0,  0,  0, 12,  3, 21, 22, 6, 18,  0,  5,255,  0,  0,  0,255,  0,  0,  1);
  savePreset(5, "FuriousGrowl");


    // Preset 0 - Classical
  //                 1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40
  setAllParameters(  0,  0, 59, 16, 74, 83,255, 155,213,  0,  0,  0,  0,  0,  0,255,  0,  0,  0,  0,  0,  0,  0,  0,  1,  3,  2,  5,  6, 18,  0,  5,255,  0,  50,255,0,  50,  0,  0);
  savePreset(0, "Classical");

    // Preset 7 - À définir
  //                 1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40
  setAllParameters(  0,  0,  0,  0,  0,  0,  0,  120, 75, 50,  0,150, 150,  0, 0,255,  0,  0,  0,  0,  0,  0,  0,  0,  1,  3, 21, 22, 23, 18,  0,  5,  0,255, 15,200,10, 255, 0,  0);
  savePreset(7, "Preset7");

