gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
    // Preset 6 - À définir
  //                 1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40
  setAllParameters(  0,  0,  0,  0,  0,  0,  0,  0,  75,  0,  0,  0,  0,  0,  0,255,  0,  0,  0,  0,  0,  0,  0,  0,  1,  3, 21, 22, 23, 18,  0,  5,255,  0, 50,  0,255, 255, 0,  0);
  savePreset(6, "Preset6");

  // Preset 4 - Simple sans effet
  //                 1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40
  setAllParameters(  0,  0, 64, 10,  0,  0,100,  80, 75,  0,  0,  0,  0,  0,  0,255,  0,  0,  0, 0,  0,  0,  0,  0,  1,  3,  2,  4,  5, 18,  0,  5,255,  0,  0,  0,255,  0,  0,  1);
  savePreset(4, "Simple");
  
  // Preset 1 - Simple avec effet
  //                 1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40
  setAllParameters(  0,  0,  0,  0,130,110,100, 100, 30,  0,255,  0,  0,  0,  0,255,  0,  0,  0, 0,  0,  0,  0,  0,  1,  3,  2,  4,  5, 18,  0,  5,255,  0,  0,255,  0,  0,  0,  1);
  savePreset(1, "Simple+Effet");
  
  // Preset 2 - Octaver and growl
  //                 1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40
  setAllParameters(  0,  0, 64, 10, 90,110,145,  0, 75,255,  0,255,140,  0,  0,255,  0,  0,  0, 0,  0,  0,  0,  0,  1,  3,  21, 22, 23, 18,  0,  5,255,255,  50,  0,255,255,  0,  1);
  savePreset(2, "OctaverGrowl");
  
  // Preset 3 - Modern siren vibrafrenzy
  //                 1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40
  setAllParameters(  0,  0,162,129,140,167,205,  0,108,  0,  0,  0,  0,  0,  0,255,  0,  0,  0,100,  0,  0,  0,  0,  1,  3,  2,  4,  5, 18,  0,  5,255,  0,  0,255,  0, 50,  0,  1);
  savePreset(3, "ModernSiren");
  

  
  

  

  
  // Preset 8 - À définir
  //                 1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40
  setAllParameters(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,255,  0,  0,  0,  0,  0,  0,  0,  0,  1,  3,  2,  4,  5, 18,  0,  5,255,  0,  0,  0,255,  0,  0,  1);
  savePreset(8, "Preset8");
  
  // Preset 9 - À définir
  //                 1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40
  setAllParameters(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,255,  0,  0,  0,  0,  0,  0,  0,  0,  1,  3,  2,  4,  5, 18,  0,  5,255,  0,  0,  0,255,  0,  0,  1);
  savePreset(9, "Preset9");
  
  Serial.println("Presets initialisés");
}
// Fonctions d'interruption pour les boutons
void IRAM_ATTR button1ISR() {
  unsigned long interruptTime = millis();
  if (interruptTime - buttonInterruptTimes[0] > BUTTON_DEBOUNCE) {
    buttonInterruptFlags[0] = true;
    buttonInterruptTimes[0] = interruptTime;
  }
}

void IRAM_ATTR button2ISR() {
  unsigned long interruptTime = millis();
  if (interruptTime - buttonInterruptTimes[1] > BUTTON_DEBOUNCE) {
    buttonInterruptFlags[1] = true;
    buttonInterruptTimes[1] = interruptTime;
  }
}

void IRAM_ATTR button3ISR() {
  unsigned long interruptTime = millis();
  if (interruptTime - buttonInterruptTimes[2] > BUTTON_DEBOUNCE) {
    buttonInterruptFlags[2] = true;
    buttonInterruptTimes[2] = interruptTime;
  }
}

// Fonction d'initialisation des interruptions
void initializeButtonInterrupts() {
  // Configuration des pins en INPUT_PULLUP
  pinMode(BUTTON_1_PIN, INPUT_PULLUP);
  pinMode(BUTTON_2_PIN, INPUT_PULLUP);
  pinMode(BUTTON_3_PIN, INPUT_PULLUP);
  
  // Attacher les interruptions (FALLING car INPUT_PULLUP)
  attachInterrupt(digitalPinToInterrupt(BUTTON_1_PIN), button1ISR, FALLING);
  attachInterrupt(digitalPinToInterrupt(BUTTON_2_PIN), button2ISR, FALLING);
  attachInterrupt(digitalPinToInterrupt(BUTTON_3_PIN), button3ISR, FALLING);
  
  Serial.println("Interruptions de boutons configurées");
}

// Fonction d'initialisation de l'interface utilisateur
void initializeUserInterface() {
 
  // Configuration des boutons push avec interruptions
  initializeButtonInterrupts();
  
  // Initialisation du ruban WS2812B
  FastLED.addLeds<WS2812B, LED_STRIP_PIN, GRB>(leds, NUM_LEDS);
  FastLED.setBrightness(BRIGHTNESS);
  FastLED.clear();
  FastLED.show();
  
  // Initialisation de l'encodeur KY-040
  encoder.attachHalfQuad(ENCODER_A_PIN, ENCODER_B_PIN);
  encoder.setCount(0);
  pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);
  
  // Initialisation de l'afficheur TM1637
  display.setBrightness(7); // 0-7
  display.clear();
 
    // Configuration ADC pour une meilleure résolution
    analogReadResolution(12); // 12 bits (0-4095)

  Serial.println("Interface utilisateur initialisée");
}

// Fonction pour lire les capteurs Sharp IR avec stabilisation - NOUVELLE STRATÉGIE
void readSharpIRSensors() {
  // Lecture stabilisée du premier capteur Sharp IR
  int stabilizedValue1 = readStabilizedIRSensor(DIST_SENSOR_1_PIN, irBuffer1, irIndex1, irSum1, irInitialized1);
  uint8_t sharpIRValue1 = stabilizedValue1 / 16;
  setParameter("pitch", sharpIRValue1);
  
  // Lecture stabilisée du deuxième capteur Sharp IR
  int stabilizedValue2 = readStabilizedIRSensor(DIST_SENSOR_2_PIN, irBuffer2, irIndex2, irSum2, irInitialized2);
  uint8_t sharpIRValue2 = stabilizedValue2 / 16;
  setParameter("vibrato_speed", sharpIRValue2);
  
  // Debug minimal
  Serial.print("IR1: ");
  Serial.print(stabilizedValue1);
  Serial.print(" -> ");
  Serial.print(sharpIRValue1);
  Serial.print(" | IR2: ");
  Serial.print(stabilizedValue2);
  Serial.print(" -> ");
  Serial.println(sharpIRValue2);
}

