gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
// Fonction pour lire les faders
void readFaders() {
  faderValues[0] = analogRead(FADER_1_PIN) / 16; // 0-4095 -> 0-255
  faderValues[1] = analogRead(FADER_2_PIN) / 16;
  faderValues[2] = analogRead(FADER_3_PIN) / 16;
  
  // Mise à jour des paramètres selon les faders
  if (faderValues[0] != lastFaderValues[0]) {
    setParameter("filter_cutoff", faderValues[0]);
    lastFaderValues[0] = faderValues[0];
  }
  
  if (faderValues[1] != lastFaderValues[1]) {
    setParameter("filter_reso", faderValues[1]);
    lastFaderValues[1] = faderValues[1];
  }
  
  if (faderValues[2] != lastFaderValues[2]) {
    setParameter("delay_time", faderValues[2]);
    lastFaderValues[2] = faderValues[2];
  }
}

// Fonction pour gérer les boutons push
void handleButtons() {
  // Lecture des boutons
  bool button1State = !digitalRead(BUTTON_1_PIN); // Inversé car INPUT_PULLUP
  bool button2State = !digitalRead(BUTTON_2_PIN);
  bool button3State = !digitalRead(BUTTON_3_PIN);
  
  // Bouton 1 - Déclencher trig_kick (paramètre 17, canal DMX 117)
  if (button1State && !lastButtonStates[0] && (millis() - lastButtonPress[0] > BUTTON_DEBOUNCE)) {
    dmxValues[116] = 255; // Canal DMX 117 (index 116)
    //Serial.println("Bouton 1 - Trig Kick déclenché");
    lastButtonPress[0] = millis();
  }
  lastButtonStates[0] = button1State;
  
  // Bouton 2 - Déclencher trig_snare (paramètre 18, canal DMX 118)
  if (button2State && !lastButtonStates[1] && (millis() - lastButtonPress[1] > BUTTON_DEBOUNCE)) {
    dmxValues[117] = 255; // Canal DMX 118 (index 117)
    //Serial.println("Bouton 2 - Trig Snare déclenché");
    lastButtonPress[1] = millis();
  }
  lastButtonStates[1] = button2State;
  
  // Bouton 3 - Charger preset 2
  if (button3State && !lastButtonStates[2] && (millis() - lastButtonPress[2] > BUTTON_DEBOUNCE)) {
    //dmxValues[116] = 255; // KICK
    //Serial.println("Bouton 3 - Preset 2 chargé");
    lastButtonPress[2] = millis();
  }
  lastButtonStates[2] = button3State;
}


// Fonction pour gérer les boutons avec interruptions
void handleButtonInterrupts() {
  // Traiter les interruptions du bouton 1
  if (buttonInterruptFlags[0]) {
    dmxValues[116] = TRIG_LENGTH; // Canal DMX 117 (trig_kick)
    Serial.println("Bouton 1 - Trig Kick déclenché (ISR) - Durée: " + String(TRIG_LENGTH));
    buttonInterruptFlags[0] = false;
  }
  
  // Traiter les interruptions du bouton 2
  if (buttonInterruptFlags[1]) {
    dmxValues[117] = TRIG_LENGTH; // Canal DMX 118 (trig_snare)
    Serial.println("Bouton 2 - Trig Snare déclenché (ISR) - Durée: " + String(TRIG_LENGTH));
    buttonInterruptFlags[1] = false;
  }
  
  // Traiter les interruptions du bouton 3
  if (buttonInterruptFlags[2]) {
    dmxValues[118] = TRIG_LENGTH; // Canal DMX 119 (trig_hh)
    Serial.println("Bouton 3 - Trig HH déclenché (ISR) - Durée: " + String(TRIG_LENGTH));
    buttonInterruptFlags[2] = false;
  }
}


// Fonction pour gérer l'encodeur KY-040
void handleEncoder() {
  int32_t currentEncoderValue = - encoder.getCount();
  
  // Calculer le preset selon la formule : |valeur_encoder / 2| % 10
  // Utiliser la valeur absolue pour éviter les problèmes avec les grandes valeurs négatives
  int32_t normalizedValue = abs(currentEncoderValue / 2);
  uint8_t newPreset = normalizedValue % MAX_PRESETS;
  
  // Si le preset a changé
  if (newPreset != selectedPreset) {
    selectedPreset = newPreset;
    
    // Charger le preset sélectionné
    loadPreset(selectedPreset);
    
    // Afficher le numéro du preset sur le display avec indicateur
    display.clear();    
    display.showNumberDec(selectedPreset);
    
    // Debug sur le moniteur série
    Serial.print("Preset changé: ");
    Serial.print(selectedPreset);
    Serial.print(" - ");
    Serial.println(presets[selectedPreset].name);
  }
  
  // Gestion du bouton de l'encodeur (toggle filtre)
  bool encoderButtonState = !digitalRead(ENCODER_BUTTON_PIN);
  if (encoderButtonState && !encoderButtonPressed && (millis() - lastEncoderButtonPress > BUTTON_DEBOUNCE)) {
    uint8_t currentFilterState = getParameter("filter_on_off");
    uint8_t newFilterState = (currentFilterState == 0) ? 255 : 0;
    setParameter("filter_on_off", newFilterState);
    
    // Afficher l'état du filtre sur le display pendant 2 secondes
    display.clear();
    if (newFilterState == 255) {
      display.showNumberDec(9999); // Afficher "9999" pour indiquer FILTRE ON
    } else {
      display.showNumberDec(0);    // Afficher "0000" pour indiquer FILTRE OFF
    }
    
    Serial.print("Filtre: ");
    Serial.println((newFilterState == 255) ? "ON" : "OFF");
    
    // Attendre 200ms puis revenir à l'affichage du preset
    delay(200);
    display.clear();
    display.showNumberDec(selectedPreset);
    
    encoderButtonPressed = true;
    lastEncoderButtonPress = millis();
  }
  
  if (!encoderButtonState) {
    encoderButtonPressed = false;
  }
}

// Fonction pour mettre à jour l'afficheur TM1637
void updateDisplay() {
  if (millis() - lastDisplayUpdate >= DISPLAY_UPDATE_INTERVAL) {
    // Afficher le preset sélectionné avec un indicateur visuel
    // Format: "P-XX" où XX est le numéro du preset
    
    display.showNumberDec(selectedPreset);
    
    lastDisplayUpdate = millis();
  }
}

void setup()
{
  Serial.begin(115200);
  Serial.println("=== Contrôleur Interactif ESP32 ===");
  Serial.println("Initialisation...");
  
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques
  btStop();
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");
  
  // Afficher l'adresse MAC de l'ESP32
  Serial.print("Adresse MAC ESP32: ");
  Serial.println(WiFi.macAddress());
  
  // Initialisation du tableau DMX à 0
  for (int i = 0; i < 512; i++) {
    dmxValues[i] = 0;
  }
  
  // Initialisation des paramètres
  initializeParameters();
  
  // Initialisation des presets
  initializePresets();
  
  // Chargement du preset 1 au démarrage
  loadPreset(1);
  
  // Initialisation de l'interface utilisateur
  initializeUserInterface();
  
  // Configuration ESP-NOW
  WiFi.mode(WIFI_STA);
  
